In [10]:
from flask import Flask, render_template, request, request, redirect, url_for
import csv
import firebase_admin
from firebase_admin import credentials
from firebase_admin import db
import json
import pandas as pd
import requests

In [2]:
cred = credentials.Certificate('se-test-7f7e1-firebase-adminsdk-auhlb-b7b4173ae5.json')
firebase_admin.initialize_app(cred, {
    'databaseURL': 'https://se-test-7f7e1-default-rtdb.firebaseio.com/'
})

# Update data or push data

In [12]:
import requests

# Set the Firebase Realtime Database URL
database_url = 'https://se-test-7f7e1-default-rtdb.firebaseio.com/'

# Specify the path where you want to add the data
path = 'students/batch/19/CSE'


# for i in range(len(data)):
#     data_id = data['Student_ID'][i]
#     data_ip = {
#         'name' : data['Name'][i],
#         'studentID': data_id,
#     }
    
#     response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
#     if response.status_code == 200:
#         continue
#     else:
#         print("error")

In [16]:
path = 'students/batch/19/AI'

# ai_19_data = pd.read_csv("C:\\Users\\schai\\Downloads\\19_AI.csv", delimiter = ",")
for i in range(len(data)):
    data_id = ai_19_data['Student_ID'][i]
    data_ip = {
        'name' : data['Name'][i],
        'studentID': data_id,
    }
    
    response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

In [ ]:
path = 'students/batch/20/CSE'

data_2020 = pd.read_csv()

for i in range(len(data)):
    data_id = data['Student_ID'][i]
    data_ip = {
        'name' : data['Name'][i],
        'studentID': data_id,
    }
    
    response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

In [23]:
path = 'faculty'


# "C:\Users\schai\Downloads\faculty_details.csv"
faculty_data = pd.read_csv("C:\\Users\\schai\\Downloads\\faculty_details.csv")

for i in range(len(faculty_data)):
    faculty_id = faculty_data['facultyID'][i]
    data_ip = {
        'name' : faculty_data['Name'][i],
        'facultyID':str(faculty_id),
        'enrolYear': int(faculty_data['enrolYear'][i])

    }
    
    response = requests.put(f'{database_url}/{path}/{faculty_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

In [19]:
faculty_data

  facultyID    Name  enrolYear
0     fe123  Suresh       2019
1     fe124  Ramesh       2017
2     fe125  Srikar       2018
3     fe126  Priyam       2017
4     fe127  Ganesh       2015

In [21]:
ai_19_data

    Student_ID    Name
0  SE19UEEE001  Rindha
1  SE19UEEE002  Sonali
2  SE19UEEE003  Ranjit
3  SE19UEEE004  Vishal
4  SE19UEEE005   Rohan
5  SE19UEEE006   Nihil

In [23]:
path = 'students/batch/19/AI'

ai_19_data = pd.read_csv("E:\\19_AI.csv")

In [26]:
ai_19_data['year'] = 4

In [27]:
ai_19_data

   Student_ID \t      Name  year
0    SE19UARI001   Sridhar     4
1  SE19UARI002\t    Anjali     4
2  SE19UARI003\t     Navya     4
3    SE19UARI004      Ravi     4
4  SE19UARI005\t     Reddy     4
5    SE19UARI006  Jitender     4

In [30]:
for i in range(len(ai_19_data)):
    data_id = str(ai_19_data['Student_ID \t'][i])
    data_ip = {
        'name' : str(ai_19_data['Name'][i]),
        'studentID': data_id
    }
    
    response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

error
error
error

In [16]:
ai_19_data

    Student_ID    Name
0  SE19UEEE001  Rindha
1  SE19UEEE002  Sonali
2  SE19UEEE003  Ranjit
3  SE19UEEE004  Vishal
4  SE19UEEE005   Rohan
5  SE19UEEE006   Nihil

In [20]:
path = 'students/batch/19/EEE'

ai_19_data = pd.read_csv("E:\\19_EEE.csv", delimiter = ",")

for i in range(len(ai_19_data)):
    data_id = ai_19_data['Student_ID'][i]
    data_ip = {
        'name' : ai_19_data['Name'][i],
        'studentID': data_id,
    }
    
    response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

In [33]:
path = 'students/batch/20/CSE'

data = pd.read_csv("E:\\20_CSE.csv")

for i in range(len(data)):
    data_id = data['Student_ID'][i]
    data_ip = {
        'name' : data['Name'][i],
        'studentID': data_id,
    }
    
    response = requests.put(f'{database_url}/{path}/{data_id}.json', json=data_ip)
    
    if response.status_code == 200:
        continue
    else:
        print("error")

# Grades